.ORIG	x3000
AND R0,R0,#0  ; Καθαρίζουμε τον R0 και τον αρχικοποιούμε σα μετρητή μήκους
LEA R2,SYM ;Φορτώνουμε στον R2 τη διεύθυνση μνήμης που αρχίζει η συμβολοσειρά
LDR R1,R2,#0 ;φορτώνουμε στον R1 το πρώτο γράμμα της συμβολοσειράς
LOOP BRz FINISH ;Ελέγχουμε αν το γράμμα είναι το τέλος της συμβολοσειράς x0000
ADD R0,R0,#1 ;Αν όχι αυξάνουμε το μήκος κατα ένα
ADD R2,R2,#1 ;Προσθέτουμε ένα στον R2 ώστε να πάρουμε τη διεύθυνση του επόμενου γράμματος της λέξης στη μνήμη 
LDR R1,R2,#0 ;Φορτώνουμε το γράμμα αυτό στον R1
BR LOOP ;επαναλαμβάνουμε τη διαδικασία
FINISH ;Ο R0 έχει την απάντηση
HALT
SYM .STRINGZ "Counthis"
.END